app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" ORDER BY created_at desc LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" IN (3, 2) ORDER BY "likes"."created_at" DESC
SELECT "photos".* FROM "photos" WHERE "photos"."post_id" IN (3, 2)
---
  def index
    @posts = Post.paginate(page: params[:page], per_page: 5).includes(
      :photos, :user, :likes
    )
                 .order('created_at desc')

SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."post_id" = $2 LIMIT $3  [["user_id", 1], ["post_id", 5], ["LIMIT", 1]]
SELECT  "photos".* FROM "photos" WHERE "photos"."post_id" = $1 ORDER BY "photos"."id" ASC LIMIT $2  [["post_id", 5], ["LIMIT", 1]]
---
  def show
    @photos = @post.photos
    @likes = @post.likes.includes(:user)

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", ""], ["user_id", 1], ["created_at", "2024-02-09 05:24:45.364179"], ["updated_at", "2024-02-09 05:24:45.364179"]]
INSERT INTO "photos" ("image", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["image", "yezeoawjpuxyauwqfors.png"], ["post_id", 1], ["created_at", "2024-02-09 05:24:45.539867"], ["updated_at", "2024-02-09 05:24:45.539867"]]
---
  def create
    @post = current_user.posts.build(post_params)
    if @post.save
      params[:images]&.each do |img|
        @post.photos.create(image: params[:images][img])

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 3]]
---
  def destroy
    if @post.user == current_user
      if @post.destroy

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def find_post
    @post = Post.find_by id: params[:id]