app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN (5, 7) ORDER BY "comments"."created_at" DESC
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" IN (5, 7) ORDER BY "likes"."created_at" DESC
SELECT "photos".* FROM "photos" WHERE "photos"."post_id" IN (5, 7)
SELECT "posts".* FROM "posts" INNER JOIN "bookmarks" ON "bookmarks"."post_id" = "posts"."id" WHERE (bookmarks.user_id=1)
---
  def show
    @user = User.find(params[:id])
    set_meta_tags title: @user.name
    @posts = @user.posts.includes(:photos, :likes, :comments)